app/Controllers/Blog.php

SELECT *
FROM `blogs`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new BlogModel();
        $data['blogs'] = $model->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `blogs`
WHERE `slug` = 'recommendations-for-learning-cryptography'
 LIMIT 1
SELECT *
FROM `blogs`
WHERE `slug` != 'recommendations-for-learning-cryptography'
---
    public function view($slug)
    {
        $model = new BlogModel();
        $blog = $model->where('slug', $slug)->first();

        if (!$blog) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Blog not found');
        }

        $data['blog'] = $blog;
        $data['other_blogs'] = $model->where('slug !=', $slug)->findAll();